[
  {
    "DIP": 1,
    "title": "Safety Module Restoration & Staker Recovery",
    "status": "Proposed",
    "author": "Paradigm",
    "shortDescription": "Restore functionality to the Safety Module staking pool.",
    "discussions": "https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause",
    "created": "2021-09-23T00:00:00.000Z",
    "preview": "**DIP Summary**\n\nRestore functionality to the Safety Module staking …",
    "basename": "DIP-1",
    "description": "\n\n\n**DIP Summary**\n\nRestore functionality to the Safety Module staking pool. Allow users who are currently staked to recover their funds and receive an additional 10% of their staked amount to make them whole.\n\n**Abstract**\n\nThe dYdX Foundation open-sourced a proposed solution that will do the following in order to minimize impact to users:\n\n\n\n* Restore functionality to the Safety Module.\n* Allow the users who are currently staked to recover their funds.\n* Reimburse those users for the missed rewards that they should have received for participating in the Safety Module, based on the consensus view of the community.\n\n**Relevant Links**\n\n\n\n* Safety Module Incident Report: [https://dydx.foundation/blog/en/outage-1](https://dydx.foundation/blog/en/outage-1)\n* Community discussion thread: [https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause](https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause)\n* DRC - Incident Report of the Safety Module Outage & Proposed Solution Thread: [https://commonwealth.im/dydx/proposal/discussion/1770-drc-incident-report-of-the-safety-module-outage-proposed-solution](https://commonwealth.im/dydx/proposal/discussion/1770-drc-incident-report-of-the-safety-module-outage-proposed-solution)\n* DRC Snapshot: [https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn](https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn)\n* Pull Request with Proposed Fix Implementation: [https://github.com/dydxfoundation/governance-contracts/pull/1](https://github.com/dydxfoundation/governance-contracts/pull/1)\n* Safety Module Smart Contract: [https://etherscan.io/address/0x65f7BA4Ec257AF7c55fd5854E5f6356bBd0fb8EC](https://etherscan.io/address/0x65f7BA4Ec257AF7c55fd5854E5f6356bBd0fb8EC)\n* Safety Module Documentation: [https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool](https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool)\n* Safety Module Blogpost: [https://dydx.foundation/blog/en/safety-staking](https://dydx.foundation/blog/en/safety-staking)\n\n**Motivation**\n\nShortly after the launch of the Safety Module staking pool, the dYdX Foundation discovered an error in the deployment process for the Safety Module smart contract. In response, access to the Safety Module staking pool was temporarily removed from [dydx.community](https://dydx.community/).\n\nFollowing the Safety Module outage, the dYdX Foundation released a detailed [incident report](https://dydx.foundation/blog/en/outage-1) explaining the cause of the error, the impact to users, a proposed solution, and lessons learned.\n\nAfter robust discussion on the Forums, a community member launched a 5-day poll on Snapshot regarding one aspect of the fix: reimbursing stakers for rewards they did not receive due to the error. The results of the poll are available [here](https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn). A minimum of 10K DYDX tokens was required to submit this off-chain proposal.\n\nIn aggregate, 575 DYDX token holders and delegates voted with 17,112,789 DYDX. With 413 voters and 16,682,487.634 DYDX (97.4855% of total) in agreement, there was an overwhelming consensus that stakers should receive 10% of their staked DYDX to make them whole.\n\n\n\n**Specification**\n\nThe Safety Module will be reset to a clean slate. Staking and earning of rewards will become active as soon as the fix is executed by governance. Users affected by the bug will receive funds via a separate Recovery Contract.\n\n***Reimbursement***\n\nThere are currently ~157,459 DYDX staked to the Safety Pool from 56 unique stakers. No staked funds were lost. Stakers will receive their funds via the Recovery Contract.\n\n***Additional Reimbursement***\n\nThose 56 stakers who were affected by the bug will receive an additional 15,746 DYDX, pro-rata, to make them whole. This will be paid out from the Rewards Treasury, and claimable by stakers through the same Recovery Contract. There will be no lockup on these funds.\n\nEach staker will need to call the claim() function directly on the Recovery Contract to receive their funds. They may then decide if they want to re-stake in the Safety Module.\n\n***Smart Contract Implementations:***\n\n\n\n1. The [Recovery Contract](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/v2/helpers/SM2Recovery.sol) will be deployed with a hardcoded mapping from address to DYDX token amount. This amount should include the amount that was staked by that address, plus the additional 10%.\n    1. As a precaution, this contract will be upgradeable via the [Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters).\n2. The new [SafetyModuleV2](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/v2/SafetyModuleV2.sol) implementation will be deployed with the following changes:\n    1. A new initializer function which:\n        1. Calls transfer() to send all held DYDX to the specified Recovery Contract address.\n        2. Calls transferFrom() to send the specified additional amount from the rewards treasury to the specified Recovery Contract address.\n        3. Restores functionality to the Safety Module by setting the correct exchange rate.\n        4. Deletes data set by the original initializer, which is now garbage due to the shift in the storage layout.\n    2. Updates DISTRIBUTION_END to account for the delayed start to the Safety Module rewards.\n    3. Updates getRevision() to return a value of 2.\n\nThe on-chain proposal to be approved by governance will include the following transaction to be executed via the [Long Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters):\n\n\n\n* Call upgradeAndCall() on the Safety Module [Proxy Admin](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/dependencies/open-zeppelin/ProxyAdmin.sol) contract, to atomically perform the following:\n    1. Upgrade the Safety Module to use the new implementation contract.\n    2. Run the initializer function with the agreed amount and Recovery Contract address.\n\n**Rationale**\n\nDifferent approaches were considered as to how to handle the funds that had already been staked. The “clean slate” approach of resetting the Safety Module is recommended as we believe it is the simplest and safest solution from a technical perspective.\n\nDiscussion on the forums has so far centered around two main issues:\n\n\n\n* **The need for the Safety Module fix to be passed as soon as possible:** Reaching community consensus and implementing a quick solution will allow affected addresses to recover their funds, and allow everyone to access the Safety staking pool. The Safety Module adds an additional safeguard to the protocol. It should be noted that Safety Module contract upgrades must use the long timelock, which imposes a minimum 18 day period (~1 day voting delay, 10 days voting duration, and 7 day timelock) between when a proposal is created and when it takes effect. In addition, long timelock proposals require a minimum quorum of 100 million DYDX (10% of the total supply) in order to pass. This means any solution will require broad community support as well as governance participation from dYdX investor token holders. For these reasons, it is imperative that the community approve this DIP in its simplest form as soon as possible.\n* **The amount to offer affected addresses to make them whole:** Staked DYDX tokens have been locked in the smart contract since September 7, and remain locked until a fix is implemented by governance. Given that the Staking Module only processes withdrawals on an epoch basis (every 28 days), the staked tokens would have been locked at a minimum for the remainder of the epoch. The community generally agreed that it was reasonable to make stakers whole due to this error. Consensus evolved around the need to repay stakers for the amount they reasonably could have expected to earn by staking over an epoch, plus some damages. 10% of the amount staked for each affected address is a reasonable and simple policy.\n\n**Test Cases**\n\nThe Safety Module has a full suite of [unit tests](https://github.com/dydxfoundation/governance-contracts/tree/master/test/safety-module) providing 100% code coverage. The proposed fix was simulated in both a local and forked mainnet environment. The test suite was then run, to ensure that full functionality will be restored, following the execution of the governance proposal on mainnet.\n\nIn addition to unit testing, thorough validation was performed on the mainnet state to ensure that we have a thorough and accurate understanding of both the current smart contract state on mainnet and the precise nature of the bug. This validation included checking all smart contract [state](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/state.spec.ts) and [logs](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/events.spec.ts), verification of the contract [bytecode](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/bytecode.spec.ts), and detailed analysis of [storage slots](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/storage-slots.spec.ts), including those that are not directly accessible by the contract. All test and deploy scripts are open-sourced in the dYdX Foundation [governance contracts](https://github.com/dydxfoundation/governance-contracts) repository.\n\n[Detailed instructions](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/README.md) are provided on GitHub to allow anybody to run the same tests.\n\n**Implementation**\n\nA [full implementation](https://github.com/dydxfoundation/governance-contracts/tree/master/contracts/safety/v2) is open-sourced in the dYdX Foundation governance contracts repository.\n\n**Copyright**\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n\n\n",
    "ipfsHash": "QmZFHNmxsyhNFD96jwoa2eHTMa34KjgP8j7Y9W8URdGeS9",
    "encodeIpfsHash": "0xa21087d039fe569dd88424d4051a7e407c6d80b4fbb389280fc0b0eea9877cbe"
  },
  {
    "DIP": 10,
    "title": "dYdX Trader Reward Formula Fee Parameter Update",
    "status": "Approved",
    "author": "Max Holloway of Xenophon Labs (twitter @XenophonLabs)",
    "shortDescription": "Increase Fee Weight in dYdX Trader Reward Formula",
    "discussions": "https://forums.dydx.community/discussion/4190-discussion-dydx-trader-rewards-mechanism-review",
    "created": "2022-04-27T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThe purpose of this DIP is to change the weight …",
    "basename": "DIP-10",
    "description": "\n\n## Simple Summary\n\nThe purpose of this DIP is to change the weight of the fee parameter from `a=0.67` to `a=0.8`, and decreasing the open interest parameter from `b=0.28` to `b=0.15` in the trader rewards formula, which we expect will lead to an increase in fees paid and a decrease in average open interest in each epoch. The dYdX Community voted and approved these changes via a Snapshot vote that concluded on April 23, 2022.\n\n## Abstract\n\nThe dYdX Grants Program [funded](https://dydxgrants.com/funded-grants/approved-grants/rewards-optimization-research-and-paper) [Xenophon Labs](https://xenophonlabs.com/) to conduct [research](https://xenophonlabs.com/dydx_trade_rewards.pdf) into the dYdX trader rewards mechanism. In addition to demonstrating provably optimal rewards-maximizing trading strategies, we found that cumulative fees paid by the protocol are approximately linear in the fee weight parameter `a`. We also find that incentivizing open interest has not made a tangible impact on long-term protocol growth. Therefore, we propose an increase in the fee weight parameter `a` and a decrease in the open interest parameter `b`.\n\nWe submitted a snapshot vote on April 18 2022 to conclude on April 23 2022. The Snapshot vote concluded with 8.2M DYDX voting \"Yes\" and 1.7M DYDX voting \"NO\". The majority of the community (312 voters & 82.51%) supported to change the formula. This passes the quorum and consensus requirements for an off-chain proposal.\n\n## Motivation / Rationale\n\nOur research suggests that dYdX is leaving money on the table by giving open interest such a high weight in the trader rewards formula. This change is an effort to generate more revenue for the protocol. Specifically, we expect revenues to increase 20\\%, which at current prices would lead to an increase in trading fees paid of approximately \\$3M per epoch. For a more in-depth summary, see the post [here](https://forums.dydx.community/discussion/4190-discussion-dydx-trader-rewards-mechanism-review); for the research itself, see the research paper [here](https://xenophonlabs.com/dydx_trade_rewards.pdf).\n\n### Important Objections\n* Stakeholders who believe open interest parameter is more important than exchange revenues should vote `no` on this proposal.\n* Stakeholders who are currently maximizing their trader rewards will receive lower returns-per-fees-paid, however they will *also* not need to carry out as much open interest as before. How this affects their rewards-profit maximizing behavior is up to them to decide.\n\n\n## Specification\nAll relevant terms are defined in [dYdX's community documentation](https://docs.dydx.community/dydx-governance/rewards/trading-rewards#:~:text=DYDX%20will%20be%20distributed%20to,to%20any%20vesting%20or%20lockups.).\n\n\n## Implementation\n\n\ndYdX smart contracts do not directly control the trader rewards mechanism. If approved, the dYdX Foundation will request that dYdX Trading Inc. implement the changes in time for Epoch 10 (May 10, 2022).\n\nThis change should be rather simple to implement, and it is entirely off-chain.\n1. Increase the fee weight parameter `a` from `a=0.67` to `a=0.8`.\n2. Decrease the open interest weight parameter `b` from `b=0.28` to `b=0.15`.\n\n## Relevant Links\n* [Forum Discussion](https://forums.dydx.community/discussion/4190-discussion-dydx-trader-rewards-mechanism-review)\n* [Snapshot Vote](https://snapshot.org/#/dydxgov.eth/proposal/0xce4b1334f337975a42c3f78dd16fb25e0b60e816a2d9382e402b5384bea37475)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmPZUxV5jhvXyrDYmqGtU9oyJ4Skv5KY6PPBVgr65s2miF",
    "encodeIpfsHash": "0x122535f140e09a7fc49c1e56a8fa9803807b524f32da79847824519972814210"
  },
  {
    "DIP": 11,
    "title": "A Step Towards a More Equitable Liquidity Provider Reward Structure",
    "status": "Approved",
    "author": "Callen Wintermute (@callenwm)",
    "shortDescription": "Change Liquidity Provider Reward Formula Weightings and Include Maker Volume",
    "discussions": "https://commonwealth.im/dydx/discussion/4407-a-step-towards-a-more-equitable-liquidity-provider-reward-structure",
    "created": "2022-05-03T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThe purpose of this DIP is to implement maker …",
    "basename": "DIP-11",
    "description": "\n\n## Simple Summary\n\nThe purpose of this DIP is to implement maker volume into the calculation of liquidity provider rewards, as well as reduce the weight of depth, spread and stkDYDX. This should in theory provide a more equitable distribution of rewards and incentivize LP compeition, while creating a better trading environment for users.\n\n## Abstract\n\ndYdX’s liquidity provider reward program is dominated by two liquidity providers earning +90% of rewards every Epoch. While dYdX incentivizes for depth, spread, uptime and protocol alignment, market makers are not incentivized to compete for market share. This composition of market structure is detrimental to the longevity of dYdX as it produces a sub-optimal trading environment (large spreads) and discourages entrants (rewards are cornered due to size and stkDYDX). \n\nThe Snapshot vote concluded with 553 unique voters and a total of 18,263,364 DYDX voted. The overwhelming majority of the community (539 & 99.97% of DYDX) were in favor of moving forward with this proposal.\n\n## Motivation\n\nCurrently, dYdX rewards LPs for showing size and not their ability to compete for market share. This is done by:\n- Rewarding depth with increasing returns to scale, allowing LPs who have huge size sit passively in the orderbook and earn large amounts of rewards.\n- Largely reward stkDYDX with increasing returns to scale, allowing LPs with a big stkDYDX balance to compound their rewards as opposed to new entrants who need significant capital outlay to compete.\n\nThis deters new MM's from competiting as the current reward scheme is dominated by 2 LPs. This is not sustainable for one of the largest derivative protocols. Futhermore, by not incentivizing LPs to compete for market share there is less liquidity at the top of the order book which is not ideal for traders on the platform.\n\n## Specification\n\nProposed solution: \n1. Introduce maker volume into the calculation of LP rewards\n2. Reduce the weight of depth, spread and stkDYDX\n\nNew Liquidity Provider Reward Calculation:\nLet,\n\n![image](https://user-images.githubusercontent.com/105179217/167971038-8ead6700-61fd-410a-911c-6d256e7f8b2d.png)\n\nThe total rewards score for an individual LP, Qi, is then calculated as follows:\n\n![image](https://user-images.githubusercontent.com/105179217/167971051-cec27e63-dac0-45bc-8195-a8fbd08ed87a.png)\n\nNote:\nIn the original formula stkDYDX is defined as:\n\n![image](https://user-images.githubusercontent.com/105179217/167971084-261f87b5-6c5b-4453-9fc2-ffc0be53cc68.png)\n\nrepresenting an LP’s average stkDYDX score as a proportion of the total pool of stkDYDX. However, given that “Total Pool stkDYDX” is constant across all LPs it simply scales each LP’s score. Therefore,\n\n![image](https://user-images.githubusercontent.com/105179217/167971099-78235ec4-0f0d-481b-bf29-d617ced539dc.png)\n\nis equivalent. This is true for uptime and maker volume as well.\n\nConstant Returns to Scale:\nThe new weightings are constructed to have constant returns to scale i.e.,\n\n![image](https://user-images.githubusercontent.com/105179217/167971164-c5b650e7-e251-4f4e-97c6-2648f1193b8a.png)\n\nThis ensures that if an LP were to split their activity in half across two addresses, they would receive half of their share of rewards in each address and therefore, the same total amount of rewards. Originally, d = 1, v = 0, and s =0.5 producing increasing returns to scale. This advantages large players and incentives combining activity in a single address. For example, doubling the depth posted and stkDYDX results in more than twice the reward share currently.\n\n## Rationale\n\nIntroducing maker volume rewards active liquidity, pushing current liquidity closer to ‘desired’ liquidity by inviting competition towards the top of the order book. Naturally, spreads become tighter as LPs fight for market share, traders receive a better trading environment, and active LPs are rewarded for facilitating flow. Weighting maker volume with the highest exponent of v = 0.45 (except uptime), should incentivize such behavior. However, when combined with a reduction in the weight of depth and spread, there is a possibility that deep/passive liquidity is overpenalized.\n\nWithout reducing the weight of depth and spread, I expect LPs with large size to continue sitting deep in the order book unless disincentivized. Reducing the exponent of Di from d = 1 to d = 0.35, forces LPs to re-optimize their strategy from passive to active as incentives get cut, once again inviting a better trading experience for users and a more equitable reward scheme amongst a variety of LPs. One concern with the aforementioned changes is the possibility of overpenalizing depth and the quality of liquidity, discouraging large traders from using dYdX. Our goal is to not strictly eliminate depth, but instead taper how much dYdX is paying for such liquidity.\n\nThe final reduction in weighting is for the stkDYDX term, from s = 0.5 to s = 0.2. Currently, stkDYDX plays a notable role in LPs receiving rewards. While a large stkDYDX balance is not necessary to achieve a substantial amount of rewards (i.e. new kid on the block), LPs with large amounts of stDYDX can afford to be ‘lazy’ and/or dominate reward share. This leads to incumbents having a major competitive advantage over entrants, and misalignment with current and desired liquidity. As early supporters, Wintermute has chosen to stake a large majority of our rewards and thus have a large stkDYDX balance. While rewarding early supporters is important and having stkDYDX in the LP calculation is beneficial for LP-protocol alignment, I think reducing the dependency on stkDYDX will allow for a more equitable distribution of rewards and increase LP participation.\n\nAlternative Weighting:\nThe proposed weights were chosen based on how desired liquidity could be achieved without overpenalizing depth, favoring an LPs ability to compete for market share as opposed to showing size. However, it’s important to consider alternative weighting:\n\nScenario 1:\nEqually weight maker volume and depth/spread:\n\n![image](https://user-images.githubusercontent.com/105179217/167971277-f6b13812-3668-4a5a-acd6-a374b6783e40.png)\n\nScenario 2:\nEqual Weights w/ Reduce weight of stkDYDX (i.e., LP - Protocol Alignment):\n\n![image](https://user-images.githubusercontent.com/105179217/167971287-e15f7680-932d-4221-85f0-972967ec2d68.png)\n\nScenario 3:\nHeavily Favor Maker Volume:\n\n![image](https://user-images.githubusercontent.com/105179217/167971296-bfb30a6e-5aaa-446b-bc1f-673d601ac2e9.png)\n\nScenario 4:\nHeavily Favor Depth/Spread:\n\n![image](https://user-images.githubusercontent.com/105179217/167971306-b70f982d-70c7-4536-8a6a-b1d17e555685.png)\n\nGeneral Consensus:\nThe very large majority of the community were in favour of introducing maker volume and reducing the weights of stkDYDX, depth and spread. There 2 prominent arguments were the constructs of the weights: v = 0.45, d = 0.35, s = 0.2 vs. v = 0.7, d = 0.2, s = 0.1. However, the weights introduced in this proposal were seen as more appropriate given the significant change this proposal introduces in general. Futhermore, this proposal is intended to limit the amount of rewards spent on depth without trying to completely eliminate it.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmbjEMoCCZdYuhUjCz5oNszbWCzk3GzSQ6KLeneoiiyut5",
    "encodeIpfsHash": "0xc6f0c17e6e98915bcba72a9affc86a379df78119a75be808ae72a51ba7d49cd2"
  },
  {
    "DIP": 12,
    "title": "dYdX Grants Program v1.5",
    "status": "Proposed",
    "author": "Reverie",
    "shortDescription": "Launch dYdX Grants Program v1.5 with $5.5M DYDX and Two new Trusteees",
    "discussions": "https://commonwealth.im/dydx/discussion/5808-dydx-grants-program-v15",
    "created": "2022-07-13T00:00:00.000Z",
    "preview": "## Simple Summary\n\nLaunch v1.5 of the dYdX Grants Program with $5.5m …",
    "basename": "DIP-12",
    "description": "\n\n## Simple Summary\n\nLaunch v1.5 of the dYdX Grants Program with $5.5m moved from the Community Treasury to the Grants Multi-sig. Additionally, remove two existing Trustees and appoint two new Trustees to the dYdX Grants Trust.\n\n## Abstract\n\nReverie is proposing launching a new version of the dYdX Grants Program, leveraging the lessons learned from v1, to help dYdX grow users and support the migration to the new dYdX Chain.\nReverie will continue to act as lead for the program, and maintain its position as Enforcer of the dYdX Grants Trust.\nTwo existing Trustees of the dYdX Grants Trust, Su Zhu and Zhuoxun Yin, will be removed as Trustees.\nLily Liu and Alexios Valonasis will be appointed as the new Trustees for the dYdX Grants Trust.\n\nThe snapshot vote concluded with 412 voters and 5.7M DYDX in agreement (99.76%). The vote results have shown significant support for the program.\nhttps://forums.dydx.community/snapshot/dydxgov.eth/0x65a5a0c35c41994ecee0d472a4e93d9aa3392c790153ed1c4f2fd83133c73b68\n\n**Relevant Links**\n\nDGP website: https://dydxgrants.com/\n\nDRC discussion: https://commonwealth.im/dydx/discussion/5808-dydx-grants-program-v15\n\n## Motivation\n\nFollowing on the success of dYdX Grants Program v1, the goal is to leverage the lessons learned to build a more effective, focused grants program to contribute towards protocol growth.\nThe program will focus on International growth to expand brand awarness and user adoption, and work on different research initiatives to tackle upcoming challenges with the dYdX Chain.\nAdditional grants will be funded where applicable, always with the aim of contributing towards dYdX growth.\n\nAs part of a regular changing of Trustees based on contributions and availability, Su Zhu and Zhuoxun Yin will be removed as Trustees of the dYdX Grants Trust.\nTo replace the two Trustees removed, Lily Liu and Alexios Valonasis will be appointed as the new Trustees. Lily has significant experience in the crypto space and Alexios has been an active community member with experience working alongside the dYdX Grants team.\n\n## Specification\n\n**Program Design**\n\n* $5.5M funding in DYDX\n* 6 months timeframe ahead of V4 launch\n* Reverie as Full Time Lead\n* 8 Trustees\n\nThe treasury will move $5.5m worth of DYDX to the dYdX Grants Trust multi-sig managed by the Trustees.\n\nFunds will be used to reward Grantees, pay the Lead and cover additional program costs. Grantees will be subject to milestones that can determine compensation structure, with standard payouts being 25% upfront and the remainder upon completion.\n\n**DYDX Amount**\n\nThe amount of DYDX to be moved from the community treasury to the DGP Multisig will be determined using a 24h vwap of the trades executed on the most liquid exchange, namely Binance.com. Given it makes up roughly 20% of the 24h volume, the DYDX/USDT Binance market data will be used to derive a market price. The data will be pulled from https://data.binance.vision/?prefix=data/spot/daily/trades/DYDXUSDT/. The previous day's trades will be used to capture a full 24h window so as to avoid timing constraints. The following data file is used: https://data.binance.vision/data/spot/daily/trades/DYDXUSDT/DYDXUSDT-trades-2022-07-17.zip\n\nThis formula will be used to calculate the price: Σ(Price * Volume) / Σ(Volume).\n\nFrom the data, we find: $21,982,398.76 / 10,334,499.44 = $2.13.\n\nThe DYDX Amount to be transferred will be $5,500,000 / $2.13 = **2,582,000** (rounded up to the nearest thousand for simplicity).\n\n**Trustee Changes**\n\nBelow is a formal letter drafted by the Grants team counsel outlining the actions enacted on behalf of DYDX tokenholders if the proposal passes with the regards to the changes made of Trustees.\n\nhttps://docs.google.com/document/d/1XEjuFBkxDeaSM4xG6OqOaI88LwxSLz4ZP6XJzwnZHpA/edit?usp=sharing\n\n## Rationale\n\nThe community has addressed certain concerns and issues with a v1.5 of the Grants program in the DRC, but overall consensus has been in strong support of launching. The program will work to grow the dYdX user base and trading volume through various initiatives while also helping the community tackle important questions and challenges ahead of the V4 launch.\n\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmXESDnGmBAgjU44RUrea2vCszeNsUpCjqsePJjjGRSdkV",
    "encodeIpfsHash": "0x842193abdf79d8611e365fd072cb5cd3cd679045c26ff4db5da28fdd81ab1f32"
  },
  {
    "DIP": 13,
    "title": "Simplifation of Trading Rewards",
    "status": "Approved",
    "author": "SLN Capital (@SLNcapital)",
    "shortDescription": "Simplifying Trading rewards to w=fees",
    "discussions": "https://forums.dydx.community/discussion/6324-discussion-revisionssimplification-of-trading-rewards",
    "created": "2022-08-09T00:00:00.000Z",
    "preview": "## Simple Summary\n\nUpdating the Trading Rewards formula to w=fees\n …",
    "basename": "DIP-13",
    "description": "\n## Simple Summary\n\nUpdating the Trading Rewards formula to w=fees\n\n## Abstract\n\nThe previous Trading rewards formula was overly complex and set a high bar to earn substantial rewards by requiring a participant to have a high Open Interest as well as lots of DYDX tokens.\n\nThe snapshot vote concluded with 645 voters and 21M DYDX in agreement (99.13%). The vote results have shown significant support for the program. https://snapshot.org/#/dydxgov.eth/proposal/0x28193f3cc8f0a1d1a98a7c32ea4cd51b497c27b8de6bdb36208c4fd4883a0c73\n\nRelevant Links\n\nDRC discussion: https://forums.dydx.community/discussion/6324-discussion-revisionssimplification-of-trading-rewards\n\n## Motivation\n\nCreating a more equitable distribution of reward emissions, and preventing the need for participants to put high Open Interest that is not-organic and only adds to instability in times of volatility. \n\n## Specification\n\nThe trading formula to be changed to w = fees\n\n## Rationale\n\nThe rational behind the change was to simplify the formula so it is more approachable to average traders, both in comprehension and in accessibility to meaningful rewards.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmdbMXA4M7rCvXiDAePz3War53W59pEe26DpjA3v8Xttw8",
    "encodeIpfsHash": "0xe2a394a2b62f4e18a546d5054697cf0601ede0adb0d27ff18ee8435de438d8e7"
  },
  {
    "DIP": 14,
    "title": "Winding Down the Liquidity Module",
    "status": "Proposed",
    "author": "Sixtant / Reverie",
    "shortDescription": "Wind down the existing liquidity module",
    "discussions": "https://commonwealth.im/dydx/discussion/5661-drc-winding-down-the-borrowing-pool",
    "created": "2022-09-20T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThe dYdX Liquidity Staking Pool, which allowed …",
    "basename": "DIP-14",
    "description": "\n\n## Simple Summary\n\nThe dYdX Liquidity Staking Pool, which allowed users to stake USDC that was borrowed by Market Makers, will be shut down. The remaining rewards allocated to the Liquidity Staking Pool will not be distributed, but accrue in the Rewards Treasury, which in turn can be directed by the Community.\n\n## Abstract\n\nSixtant proposed winding down the Liquidity Module due to underutilization and inefficient allocation of DYDX rewards. Data shows the USDC staked in the Pool is underutilized, resulting in the Community inefficiently rewarding stakers with DYDX for their staked USDC.\n\nWe expect to see a revamp of liquidity programs through new initiatives outside of the Liquidity Staking Pool.\n\nEach epoch, the 383,562 DYDX currently allocated to USDC stakers will instead accummulate in the Rewards Treasury. The dYdX community may redirect the DYDX from the Rewards Treasury with a vote falling under the requierement of the short timelock. Also, an additional proposal can be submitted to transfer the DYDX back to the Community Treasury if needed.\n\nThe snapshot vote concluded with 632 voters and 17M DYDX in agreement (99.96%). The vote results have shown significant support for the proposal.\nhttps://snapshot.org/#/dydxgov.eth/proposal/0x6a0c11c6749661fa59f887e521deada80d30dcbc0961af555227a5c4d0b00a4e\n\n**Relevant Links**\n\n- DRC discussion: https://commonwealth.im/dydx/discussion/5661-drc-winding-down-the-borrowing-pool\n- DRC Snapshot: https://snapshot.org/#/dydxgov.eth/proposal/0x6a0c11c6749661fa59f887e521deada80d30dcbc0961af555227a5c4d0b00a4e\n- Pull Request with the Proposed Implementation: https://github.com/dydxfoundation/governance-contracts/pull/33\n- Liquidity Module Documentation: https://docs.dydx.community/dydx-governance/staking-pools/liquidity-staking-pool\n\n## Motivation\n\nTo promote liquidity network effects and incentivize professional LPs, 2.50% of DYDX is currently allocated to be distributed over 5 years to users who stake USDC in the Liquidity Staking Pool. As a result, 383, 562 DYDX are distributed pro-rata to stakers each epoch. While this had some success initially, the program is no longer an efficient allocation of DYDX for the following reasons:\n\n**1. Underutilization**\n\nThe dYdX community is currently rewarding USDC stakers with 383, 562 DYDX each epoch. Assuming DYDX is priced at $2.00, this amounts to over $767K in DYDX. Given that $193M USDC is currently unborrowed (~70%), the dYdX community is paying DYDX rewards for underutilized USDC capital.\n\n**2. Inadequate Disclosure**\n\nMost prospective borrowers have not fulfilled the disclosure requirements that the Community voted to adopt in the borrowing framework.\n\n**3. Impact on Market Structure**\n\nIn Epoch 9, the dYdX community almost unanimously supported updating the LP rewards formula to redistribute LP rewards in a more equitable manner to incentivize competition. Currently, the structure of the borrowing pool negatively impacts competition among LPs.\n\nInstead, re-allocating the remaining rewards back to the Community Treasury will allow the DAO to scale and initiate different growth programs. In addition to this, we anticipate new liquidity programs to be launched after the winding down of this Pool.\n\n## Specification\n\nUnder the implementation, DYDX will accrue in the [Rewards Treasury](https://etherscan.io/address/0x639192D54431F8c816368D3FB4107Bc168d0E871) each epoch. The dYdX community will have control over accrued DYDX that previously would have been distributed to stakers in the liquidity module. With a governance vote DYDX held in the Rewards Treasury can be (1) sent to the Community Treasury or (2) sent directly to an Ethereum address for any Community directed purpose.\n\nThe following code changes will be approved in relation to this proposal:\n- Setting the liquidity staking pool rewards per second to 0.\n- Decreasing the length of the blackout window to three days.\n\n## Rationale\n\nThe Community had expressed overwhelming support for the winding down of the Liquidity Staking Pool in discussions. We believe this to be in the best interest of the Community and protocol.\n\n## Implementation\n\nA full implementation is open-sourced on the dYdX Foundation Github: https://github.com/dydxfoundation/governance-contracts/pull/33\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmRmBDvnkqYsjUV9bgceRS87BJswjRevGbYz3ska33mNtL",
    "encodeIpfsHash": "0x32db80af31713b3a4eda8ce6a30cf125dd8361d6f3df437c6667c98432757795"
  },
  {
    "DIP": 15,
    "title": "A Further Step Towards More Equitable LP Rewards",
    "status": "Approved",
    "author": "SLN Capital (@SLNcapital)",
    "shortDescription": "Improvement to LP rewards",
    "discussions": "https://forums.dydx.community/discussion/6322-discussion-revisions-to-improve-the-lp-reward-formula",
    "created": "2022-09-20T00:00:00.000Z",
    "preview": "## Simple Summary\n\nImprovement to LP rewards\n\n## Abstract\n\nWe …",
    "basename": "DIP-15",
    "description": "\n\n## Simple Summary\n\nImprovement to LP rewards\n\n## Abstract\n\nWe propose:\n\n- Changing the weights for non BTC/ETH markets to `v = 0.6, d = 0.35, and s = 0.05`\n- For BTC/ETH, `v = 0.8, d = 0.15, s = 0.05` \n- Reducing the amount paid for BTC/ETH to 10% / 10% rather than 20% / 20%, thus giving 80% to the other markets\n\nThe main direction then is to increase weight towards the Volume term that was added last time by Wintermute’s proposal, as well as acknowledge the maturity of BTC/ETH markets and the lower need there to incentivize book-quoting.\n\nOver time as other markets mature we can move further on towards even more simple volume weighting.\n\nOn August 14, there was a Snapshot vote on this which concluded with 505 voters and 22.7M DYDX in agreement (99.95%)- to revise the LP rewards formula and rewards allocation.\n\nRelevant Links\n\nDRC discussion: https://forums.dydx.community/discussion/6322-discussion-revisions-to-improve-the-lp-reward-formula\n\nSnapshot: https://snapshot.org/#/dydxgov.eth/proposal/0x4baa732bacdb8e05efb482535c213c682d769dcbd2a6ef117fa070404d258dec\n\n## Motivation\n\nMoving towards more sustainable LP rewards that reward liquidity providing where it is actually needed, and increase importance of volume actually done versus other metrics that are indermediary.\n\n## Specification\n\nWeights for non BTC/ETH markets to `v = 0.6, d = 0.35, and s = 0.05`\n\nWeights for BTC/ETH markets to `v= 0.8, d = 0.15, s = 0.05`\n\nReducing the amount paid for BTC/ETH to 10% / 10% rather than 20% / 20%, thus giving 80% to the other markets\n\nUpdates to the LP rewards formula and rewards allocation do not require any smart contract changes. Revisions to the LP rewards formula and rewards allocation will be implemented by dYdX Trading after the start of Epoch 15 (September 27, 2022, at 3 PM UTC). All changes will take effect in Epoch 15.\n\n## Rationale\n\nMaking a further step towards incentivizing volume, and focusing on growth markets for rewards rather than developed ones.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmYH3MFPMqpC83xRkw6K3fUnqp6p8VzwJqFmG6VSf9Fyhj",
    "encodeIpfsHash": "0x93a825455d3375f8abc16695032060089262a0ffe79078c5df464964d10da2ca"
  },
  {
    "DIP": 16,
    "title": "Reduce Trading Rewards by 25%",
    "status": "Proposed",
    "author": "Callen Wintermute (@callenwm)",
    "shortDescription": "Reduce Trading Rewards by 25%",
    "discussions": "https://forums.dydx.community/discussion/6324-discussion-revisionssimplification-of-trading-rewards",
    "created": "2022-09-21T00:00:00.000Z",
    "preview": "## Simple Summary\n\nRatify the 25% reduction in trading rewards. Each …",
    "basename": "DIP-16",
    "description": "\n\n## Simple Summary\n\nRatify the 25% reduction in trading rewards. Each Epoch 2,876,712 will be distributed as trading rewards and the remaining 958,904 DYDX (“Excess DYDX”) that were previously allocated for distribution will accrue in the Rewards Treasury. The Excess DYDX (958,904 DYDX per epoch) that accrues in the Rewards Treasury can be used/directed by the dYdX community with a governance vote ([Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters))\n\n## Abstract\n\ndYdX trading rewards are the largest form of reward emissions across the platform by a significant margin, emitting 3,835,616 DYDX per epoch or roughly 50m DYDX a year. \n\nOn July 31, the Snapshot vote to reduce trading rewards by 25% concluded with the majority (22.8M DYDX (99.13%) from 532 voters) of the dYdX community that voted in support of the reduction. This proposal seeks to ratify a 25% reduction in trading rewards.\n\nRelevant Links:\n* Snapshot:\nhttps://snapshot.org/#/dydxgov.eth/proposal/0x28193f3cc8f0a1d1a98a7c32ea4cd51b497c27b8de6bdb36208c4fd4883a0c73\n* Community Discussion:\nhttps://forums.dydx.community/discussion/6324-discussion-revisionssimplification-of-trading-rewards\n* Trading Rewards:\nhttps://docs.dydx.community/dydx-governance/rewards/trading-rewards\n* Rewards Treasury: https://etherscan.io/address/0x639192D54431F8c816368D3FB4107Bc168d0E871\n* Pull Request with the Proposed Update:\nhttps://github.com/dydxfoundation/governance-contracts/pull/34\n\n## Motivation\n  \nIn light of ongoing depressed market conditions, the current trading reward emission schedule seems excessively high relative to the growth in platform activity. When thinking about the long-term success of dYdX and its transition to v4, it makes sense to eliminate areas of overspending in the protocol to ensure future opportunities or needs can be met. This proposal requests to reduce trading rewards by 25% every epoch for the foreseeable future, eliminating the overspending of DYDX and preserving funds for future expenditure.\n\n## Specification\nProposal Changes:\n * Reduce per-epoch trading reward emissions from 3,835,616 DYDX to 2,876,712 DYDX (Excess DYDX: 958,904)\n\nNote: Excess DYDX will accrue in the Rewards Treasury, but can be moved via an on-chain community vote\n  \n*Smart Contract Implementations:*\n* Updates setRewardsParameters for trader rewards in the Merkle Distributor to 2,876,712 per epoch\n\nThe on-chain proposal to be approved by governance will include the following transaction to be executed via the [Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters):\n* Update the Merkle Distributor to the new trading rewards parameters\n\n## Rationale\nThe community was largely in agreement with the reduction in trading rewards as evident by forum discussion and the passing of a snapshot vote. While there were discussions about the magnitude of reduction in trading rewards, starting with 25% was agreed upon as a reasonable start to limiting emissions and assessing the effects on trading activity.\n\n## Test Cases\n\nA full test case is provided in the implementation found [here](https://github.com/dydxfoundation/governance-contracts/blob/486e3f4966c4f8763ce4e4e301074fa0cd18649c/test/misc/update-merkle-distributor-rewards-parameters.spec.ts).\n\n## Implementation\n\nA [full implementation](https://github.com/dydxfoundation/governance-contracts/pull/34) is open-sourced in the dYdX Foundation governance contracts repository.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmaNTf7xjjKDWe4deh2xEcJ6a4p6zHiMdDo3WSasqCDdSZ",
    "encodeIpfsHash": "0xb2c2e8a63f8ee41fc40601c1f0b0ef41f919b34cb2a0547402153cd9accd4c6a"
  },
  {
    "DIP": 17,
    "title": "Winding Down the Safety Staking Module",
    "status": "Proposed",
    "author": "Xenophon Labs",
    "shortDescription": "Wind down the existing safety staking module",
    "discussions": "https://forums.dydx.community/discussion/7013-dydx-safety-staking-review",
    "created": "2022-11-02T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThe dYdX Safety Staking Module, which allowed …",
    "basename": "DIP-17",
    "description": "\n\n\n## Simple Summary\n\nThe dYdX Safety Staking Module, which allowed users to stake DYDX that would then be used as an insurance backstop in the case of a protocol shortfall event, will be shut down. The remaining rewards allocated to the Safety Staking Module will not be distributed, but accrue in the Rewards Treasury, which in turn can be directed by the community.\n\n## Abstract\n\nXenophon Labs proposed winding down the Safety Staking Module due to its impracticality as an insurance fund and inefficient allocation of DYDX token.\n\nEach epoch, the 383,562 DYDX currently allocated to DYDX stakers will instead accumulate in the Rewards Treasury. The dYdX community may redirect the DYDX from the Rewards Treasury with a vote falling under the requirement of the short timelock. Also, an additional proposal can be submitted to transfer the DYDX back to the Community Treasury if needed.\n\nThe snapshot vote concluded with 7.7M DYDX in agreement (92.95%).\nhttps://snapshot.org/#/dydxgov.eth/proposal/0x756f174ea610a5891365f19881b3e300c719a80b16e8d67643aace30d4ca3bc4\n\n**Relevant Links**\n\n- DRC discussion: https://forums.dydx.community/discussion/7013-dydx-safety-staking-review\n- DRC Snapshot: https://snapshot.org/#/dydxgov.eth/proposal/0x756f174ea610a5891365f19881b3e300c719a80b16e8d67643aace30d4ca3bc4\n- Pull Request with the Proposed Implementation: https://github.com/dydxfoundation/governance-contracts/pull/37\n- Safety Staking Module Documentation: https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool\n\n## Motivation\n\nThere are 383,562 DYDX tokens allocated to Safety Staking Module (SSM) each epoch. This spending is meant to provide insurance power for the protocol in the case of a shortfall event. However, our research suggests that the SSM is not an effective insurance fund, due to the practical difficulty of slashing the SSM, as well as the much lower value that the DYDX token would be sellable for in the case of a shortfall event, due to market contagion and lack of liquidity. While in the long term we believe the SSM should be replaced by a module with better insurance power, such as a USDC Safety Staking Module or a USDC-DYDX Balancer LP token Safety Staking Module, this would require too much of a lift for the dYdX team currently. Thus, we believe it is appropriate to halt emissions to the current SSM until we can replace it following the launch of dYdX V4.\n\n## Specification\n\nUnder the implementation, DYDX will accrue in the [Rewards Treasury](https://etherscan.io/address/0x639192D54431F8c816368D3FB4107Bc168d0E871) each epoch. The dYdX community will have control over accrued DYDX that previously would have been distributed to stakers in the liquidity module. With a governance vote, DYDX held in the Rewards Treasury can be (1) sent to the Community Treasury or (2) sent directly to an Ethereum address for any Community directed purpose.\n\nThe following code changes will be approved in relation to this proposal:\n- Setting the safety staking module rewards per second to 0.\n- Decreasing the length of the blackout window to three days.\n\n## Rationale\n\nSee motivation.\n\n## Implementation\n\nA full implementation is open-sourced on the dYdX Foundation Github ([link](https://github.com/dydxfoundation/governance-contracts/pull/37)). We are targeting an implementation date in Epoch 17, any time after November 22, 3 PM UTC.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmT2Bkoe7bL9d51BodkLXEpgvNjs6N4MNhRpmPA6fB3L6K",
    "encodeIpfsHash": "0x458f80f0cde145e2d3cbccfeea97d961cf282bedcc291d3960b82e2bee1a2f50"
  },
  {
    "DIP": 18,
    "title": "dYdX Operations subDAO",
    "status": "Proposed",
    "author": "Reverie",
    "shortDescription": "Establish a Guernsey Purpose Trust with $360,000",
    "discussions": "https://commonwealth.im/dydx/discussion/7620-drc-dydx-operations-trust",
    "created": "2022-12-12T00:00:00.000Z",
    "preview": "## Simple Summary\n\nLaunch a dYdX Operations subDAO by establishing a …",
    "basename": "DIP-18",
    "description": "\n\n## Simple Summary\n\nLaunch a dYdX Operations subDAO by establishing a Guernsey Purpose Trust entity funded with $360,000 of DYDX transferred from the Community Treasury.\n\n## Abstract\n\nReverie is proposing to launch an Operations subDAO for the dYdX DAO to manage the publication of a DAO Playbook, run DAO communications, open a fiat bank account, and additional responsibilities.\n\nThe subDAO will be established through a Guernsey Purpose Trust, named the dYdX Operations Trust. Three Trustees and an Enforcer will be appointed to manage the responsibilities of the Trust.\n\nTo cover compensation and expenses, we are requesting a total of $360,000 in DYDX to be transferred from the Community Treasury to the Ops Trust multisig.\nThe Operations subDAO will be operational for an initial 6 month period to deliver the responsibilites outlined below.\n\nThe snapshot vote concluded with 783 voters and 7.7M DYDX in agreement (75.43%). The vote results have shown significant support for the program.\nhttps://snapshot.org/#/dydxgov.eth/proposal/0xa710b0ca85e04ac2db123ae522ac5030a008ccbc8d4d413e83d18f6032b39758\n\n**Relevant Links**\n\nDRC discussion: https://commonwealth.im/dydx/discussion/7620-drc-dydx-operations-trust\n\n## Motivation\n\ndYdX is facing an important decision to scale the protocol thoughtfully as it transitions to full community control. As a community, we have to look ahead towards organizational transformation through the use of subDAOs. Accomplishing this goal will first require guidance on structural implementation.\n\nSpeaking from experience with the Grants Trust, launching a subDAO is not quite as simple as opening a wallet and getting community funding. There are tons of legal procedures, operational headaches, and other nuances to building a truly internet-native organization. Community members should be able to benefit from the know-how and experience gained through the process that led to the creation and operation of the Grants Trust.\n\nTo keep up with the competitive landscape, the DAO will also need to operate quickly. Doing so will require a standardized process for launching new subDAOs in charge of important functions. The playbook to be written by the Ops Trust will give the community a thoughtful approach for quickly spinning up new subDAOs, including all legal and operational procedures necessary.\n\n## Specification\n\n**Trust Agreement**\nIf this proposal is passed, the Trust will be formed with dYdX Consent as defined in the Trust Agreement. The full agreement can be seen here:\nhttps://drive.google.com/file/d/16ubaQpxlnmybYkoSE5ML_NkgR36EyrH0/view?usp=sharing\n\n**The subDAO will be funded for a period of 6 months**\n\nReverie will work with outside legal counsel to establish a Guernsey Purpose Trust. The Trust will be formed with the following contributors:\n\n**Trustees**\n- Reverie Reserves, LLC\n- Joanna Pope\n- Callen Van Den Elst\n\n**Enforcer**\nGeorge Beall\n\n**Responsibilities**\n- Open a fiat bank account for the Ops Trust\n- Hire and manage external legal staff for ongoing guidance\n- Payments and Financial Reporting\n- Create communication channels for the Ops Trust, as needed, which can serve as the standard dYdX DAO’s communication channel going forward\n- Build and share a DAO playbook for launching new dYdX subDAOs\n\n**Compensation and Expenses**\n- Reverie will receive **$15,000 per month** and a **$90,000 success fee** for publishing the DAO playbook\n- Joanna Pope will receive **$1,500 per month** as Trustee\n- Callen Van Den Else has waived compensation as Trustee\n- George Beall will receive **$2,000 per month** as Enforcer\n\nWe are requesting an additional **$100,000** to cover legal and operational expenses for all Ops Trust related engagements.\n\nIn total, $360,000 will be used to fund the initial 6 month operation of the Ops subDAO.\n\n\n**DYDX Amount**\n\nThe amount of DYDX to be moved from the community treasury to the Ops Trust Multisig will be determined using a 24h vwap of the trades executed on the most liquid exchange, namely Binance.com. The previous day's trades will be used to capture a full 24h window so as to avoid timing constraints. The following data file is used: https://data.binance.vision/data/spot/daily/trades/DYDXUSDT/DYDXUSDT-trades-2022-12-10.zip\n\nThis formula will be used to calculate the price: Σ(Price * Volume) / Σ(Volume).\n\nFrom the data, we find: $6,370,831.51 / 3,967,848 = $1.606.\n\nThe DYDX Amount to be transferred will be $360,000 / $1.606 = **225,000.00 DYDX** (rounded up to the nearest thousand for simplicity).\n\n\n## Rationale\n\nThe community has addressed certain concerns and issues with a dYdX Operations subDAO run by Reverie in the DRC, namely regarding possible conflicts with the existing involvement in the Grants program. Since the responsibilities of this Trust do not overlap with our responsibilities as Grants lead and Enforcer on the dYdX Grants Trust, we believe there is no conflict in our role as Trustee for the Ops Trust. Beyond these initial concerns, overall consensus has been in strong support of launching as indicated through the Snapshot vote and general positive feedback. The dYdX Ops subDAO will act as a catalyst for the growth of the dYdX DAO through the launching of new subDAOs.\n\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmS94dN3Tb2vGFtUsDTcDTCDdp8MEWYi5YXZ4goBtFaq2W",
    "encodeIpfsHash": "0x3876d28a014bc20432dcc3549ba95710446b98431d84c7f84fde6abe1baf527f"
  },
  {
    "DIP": 19,
    "title": "Move LP rewards formula weight from stkDYDX to MakerVolume",
    "status": "Proposed",
    "author": "Xenophon Labs (@XenophonLabs)",
    "shortDescription": "Remove `stkDYDX` from LP rewards",
    "discussions": "https://forums.dydx.community/discussion/7872-drc-remove-stkdydx-from-lp-rewards-formulas",
    "created": "2022-12-10T00:00:00.000Z",
    "preview": "## Simple Summary\n\nRemove `stkDYDX` from the LP rewards mechanism, …",
    "basename": "DIP-19",
    "description": "\n\n## Simple Summary\n\nRemove `stkDYDX` from the LP rewards mechanism, and reallocate the `stkDYDX` term's weight to `MakerVolume`.\n\n## Abstract\n\nWe propose removing the `stkDYDX` term from the LP rewards mechanism and reallocating the `stkDYDX` term's weight to `MakerVolume`. The decision to remove the `stkDYDX` term follows naturally from the community's decision to wind down the safety staking module. The decision to reallocate the `stkDYDX` term's weight to the `MakerVolume` term comes from our opinion that volume is the best proxy for value that LPs provide to the protocol's traders.\n\nOn December 10, 2022, there was a Snapshot vote on this which concluded with 883 voters and 16,177,534 DYDX in agreement (99.97%) to make these LP rewards formula changes.\n\n**Relevant Links**\n* [DRC discussion](https://forums.dydx.community/discussion/7872-drc-remove-stkdydx-from-lp-rewards-formulas)\n* [Snapshot](https://snapshot.org/#/dydxgov.eth/proposal/0xa81ef2ab284b27338fcb96da592d2b1900fc121eccc445e52597c9208491afa1)\n\n## Motivation\nSince the safety staking module is being wound down, incentivizing `stkDYDX` no longer makes sense. As for giving more weight to the volume term, this is because we believe volume is the most direct way of incentivizing LPs to provide better-utilizedliquidity to traders of the protocol.\n\n\n## Specification\n\nWeights for non BTC/ETH markets to `v = 0.65, d = 0.35, and s = 0.00`. In effect, remove the `stkDYDX` (`s`) term entirely and give its previous weight to the volume (`v`) term.\n\nWeights for BTC and ETH markets to `v= 0.85, d = 0.15, s = 0.00`. In effect, remove the `stkDYDX` (`s`) term entirely and give its previous weight to the volume (`v`) term.\n\nUpdates to the LP rewards formula and rewards allocation do not require any smart contract changes. Revisions to the LP rewards formula and rewards allocation will be implemented by dYdX Trading after the start of Epoch 18 (December 20, 2022, at 3 PM UTC). Epoch 18's rewards will be calculated using the new weights.\n\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).",
    "ipfsHash": "QmebV2ntcEdbBNMUc1zJmUgi2vwCaWiNSJ2dzHyJQdupvh",
    "encodeIpfsHash": "0xf187c29be2b43edcd0d4f7771be7a12b2ba879e5afb02e65f60ec59bf4de25c6"
  },
  {
    "DIP": 2,
    "title": "Reducing liquidity provider rewards threshold from 5% to 1%",
    "status": "Implemented",
    "author": "Jacob Goh (@jteamdc)",
    "short description": "Reducing market maker threshold from 5% to 1%",
    "discussions": "https://forums.dydx.community/proposal/discussion/1805-reduce-market-maker-incentives/",
    "created": "2021-10-07T00:00:00.000Z",
    "preview": "## Simple Summary\nThe purpose of this DIP is to reduce the liquidity …",
    "basename": "DIP-2",
    "description": "\n\n## Simple Summary\nThe purpose of this DIP is to reduce the liquidity provider rewards threshold for market makers from 5% to 1% so that smaller and medium-sized market makers can be included as well.\n\n## Abstract\n\nIn reference to a thread on market maker incentives, Su Zhu from Three Arrows Capital submitted a Snapshot vote to reduce the volume threshold % for market makers to qualify to receive Liquidity Provider Rewards. \n\nThe Snapshot vote concluded with a record 764 unique voters and 55M DYDX in agreement. The majority of the community (399 voters & 86% of DYDX) supported to reduce the threshold to 1%.\n\n\n\n**Relevant Links**\n\n\n* Reference to a thread on market maker incentives:[https://forums.dydx.community/proposal/discussion/1805-reduce-market-maker-incentives/](https://forums.dydx.community/proposal/discussion/1805-reduce-market-maker-incentives/)\n* Snapshot vote for DYDX holders from Su Zhu at Three Arrows Capital: [https://snapshot.org/#/dydxgov.eth/proposal/QmXtS7CGVX7C5v2JdcJpsqWAeZrStQcogSQpP6zzhzwLmN](https://snapshot.org/#/dydxgov.eth/proposal/QmXtS7CGVX7C5v2JdcJpsqWAeZrStQcogSQpP6zzhzwLmN)\n* Maker Volume Distibution: [https://metabase.dydx.exchange/public/dashboard/5fa0ea31-27f7-4cd2-8bb0-bc24473ccaa3](https://metabase.dydx.exchange/public/dashboard/5fa0ea31-27f7-4cd2-8bb0-bc24473ccaa3)\n\n\n## Motivation\n\nHaving a high threshold of 5% is worse for liquidity on dYdX. It excludes smaller and medium-sized market makers from competing with larger market makers. \n\n5 more market makers would be included in epoch 0/1 if the threshold had been reduced to 1%.\n\n\n\n\n## Rationale\n\n Reducing this threshold from 5% to 1% will provide better competition for tight quoting and uptime (especially on alt pairs, which have had quite wide spreads) and should result in better liquidity overall across dYdX Protocol. \n\n**Copyright**\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmTxhXiG4QvSGAw75GygScspiFbsWVsdgmTmgDpTyAZG5L",
    "encodeIpfsHash": "0x53868881cd042ee75405ac8c2b76e8ee1e0959bfb4c25b3624c2ebafbcf78da7"
  },
  {
    "DIP": 20,
    "title": "Reduce Trading Rewards by ~45%",
    "status": "Proposed",
    "author": "Callen - Wintermute (@callenwm)",
    "shortDescription": "Reduce Trading Rewards to 1,582,192 DYDX per epoch",
    "discussions": "https://forums.dydx.community/discussion/9949-drc-reduce-trading-rewards-by-45",
    "created": "2023-02-23T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThis proposal seeks to reduce trading rewards to …",
    "basename": "DIP-20",
    "description": "\n\n## Simple Summary\n\nThis proposal seeks to reduce trading rewards to 1,582,192 DYDX from 2,876,712 DYDX. The excess 1,294,520 DYDX will accrue in the Rewards Treasury and can be used/directed by the dYdX community with a governance vote ([Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters)).\n\n## Abstract\n\nAs part of our [V4 Vanguard Post](https://forums.dydx.community/discussion/9916-v4-vanguard), we propose to reduce Trading Rewards by ~45%. In the current market downturn, we believe Trading Rewards remain excessive and are the highest contributor to yearly token inflation.\n\nOn Feb 15th, 2023, there was a Snapshot vote to gauge the community’s sentiment towards such a change. The vote passed with 27,534,218 DYDX in favour (91.60% of votes) from 776 voters.\n\n### Relevant Links\n- [Snapshot](https://snapshot.org/#/dydxgov.eth/proposal/0xf6560afee2b771db087a9bf67abb1aa98023cabff066c0e7033fb83d2980179c)\n- [Forum Discussion](https://forums.dydx.community/discussion/9949-drc-reduce-trading-rewards-by-45)\n\n## Motivation\nBy reducing trading rewards, excess DYDX are retained in the rewards/community treasury. This can be accessed by the community through a governance vote, but most importantly, the retained DYDX will have a significant impact on the DAOs ability to fund initiatives in V4 in a sustainable and controlled manner!\n\n## Specification\n\n### Proposed Changes:\n- Reduce per-epoch trading reward emissions to 1,582,192 DYDX from 2,876,712 DYDX (Excess DYDX: 1,294,520)\nNote: Excess DYDX will accrue in the Rewards Treasury, but can be moved via an on-chain community vote.\n\n### Smart Contract Implementations:\nUpdates setRewardsParameters for trader rewards in the Merkle Distributor to 1,582,192 per epoch\nThe on-chain proposal to be approved by governance will include the following transaction to be executed via the [Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters):\n- Update the Merkle Distributor to the new trading rewards parameter.\n\n## Rationale\n\nThe magnitude of the cut to Trading Rewards was driven by the disproportionate allocation towards DYDX Trading Rewards in comparison to Liquidity Provider Rewards and the Community/Rewards Treasury. Furthermore, the change aligns with a new distribution and emission schedule outlined in V4 Vanguard. There were community members not in favour of the reduction, however, given the current market conditions the majority of the community was in favour of this proposal as indicated in the Snapshot.\n\n## Test Cases\n\nA full test case is provided in the implementation found [here.](https://github.com/dydxfoundation/governance-contracts/blob/f82ae1165d428b282da57831408da4520bd8570e/test/misc/update-merkle-distributor-rewards-parameters-v2.spec.ts)\n\n## Implementation\n\nA full implementation of the proposed change can be found [here.](https://github.com/dydxfoundation/governance-contracts/pull/39/commits/f82ae1165d428b282da57831408da4520bd8570e#diff-7eb7d483f4a795b587ba7224faf58d79f0ffa5e2ef1924534d50c2c740e733ba)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmdehgEyauerEdgUiatn6gM1mCY9s1RYy6pF7WqSFd8bCQ",
    "encodeIpfsHash": "0xe37f1d3d22bc1d86f6273c8513d30e3c81f44cd3befa3d2f04c849d82c6c0ab5"
  },
  {
    "DIP": 3,
    "title": "Safety Module Restoration",
    "status": "Proposed",
    "author": "Paradigm",
    "shortDescription": "Restore functionality to the Safety Module staking pool.",
    "discussions": "https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause",
    "created": "2021-10-14T00:00:00.000Z",
    "preview": "**DIP Summary**\n\nRestore functionality to the Safety Module staking …",
    "basename": "DIP-3",
    "description": "\n\n\n**DIP Summary**\n\nRestore functionality to the Safety Module staking pool. Recover locked funds and send them to the Rewards Treasury.\n\n**Abstract**\n\nAn error in the Safety Module deployment led to stakers' funds being stuck in the contract. As a result, we submitted [DIP-1](https://github.com/danrobinson/dip/blob/master/content/dips/DIP-1.md) as a proposal to fix the Safety Module, return funds to stakers, and compensate stakers for their missed rewards and inconvenience.\n\nThe on-chain vote for DIP-1 failed. This new proposal aims to fix the Safety Module in the same way proposed by DIP-1, but without making any reimbursements or other compensation for users (this could be addressed by governance seperately). Funds locked in the Safety Module will be sent to the Rewards Treasury.\n\n**Relevant Links**\n\n\n\n* Safety Module Incident Report: [https://dydx.foundation/blog/en/outage-1](https://dydx.foundation/blog/en/outage-1)\n* Community discussion thread: [https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause](https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause)\n* DRC - Incident Report of the Safety Module Outage & Proposed Solution Thread: [https://commonwealth.im/dydx/proposal/discussion/1770-drc-incident-report-of-the-safety-module-outage-proposed-solution](https://commonwealth.im/dydx/proposal/discussion/1770-drc-incident-report-of-the-safety-module-outage-proposed-solution)\n* DRC Snapshot: [https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn](https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn)\n* Pull Request with Proposed Fix Implementation: [https://github.com/dydxfoundation/governance-contracts/pull/1](https://github.com/dydxfoundation/governance-contracts/pull/1)\n* Safety Module Smart Contract: [https://etherscan.io/address/0x65f7BA4Ec257AF7c55fd5854E5f6356bBd0fb8EC](https://etherscan.io/address/0x65f7BA4Ec257AF7c55fd5854E5f6356bBd0fb8EC)\n* Safety Module Documentation: [https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool](https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool)\n* Safety Module Blogpost: [https://dydx.foundation/blog/en/safety-staking](https://dydx.foundation/blog/en/safety-staking)\n\n**Motivation**\n\nAs discussed in DIP-1, following the Safety Module outage, the dYdX Foundation released a detailed [incident report](https://dydx.foundation/blog/en/outage-1) explaining the cause of the error, the impact to users, a proposed solution, and lessons learned. This proposal aims to fix the Safety Module in as simple a way as possible.\n\n**Specification**\n\nThe Safety Module will be reset to a clean slate. Staking and earning of rewards will become active as soon as the fix is executed by governance.\n\n***Smart Contract Implementations:***\n\n* The new [SafetyModuleV2](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/v2/SafetyModuleV2.sol) implementation will be deployed with the following changes:\n    1. A new initializer function which:\n        1. Calls transfer() to send all held DYDX to the Rewards Treasury.\n        2. Restores functionality to the Safety Module by setting the correct exchange rate.\n        3. Deletes data set by the original initializer, which is now garbage due to the shift in the storage layout.\n    2. Updates DISTRIBUTION_END to account for the delayed start to the Safety Module rewards.\n    3. Updates getRevision() to return a value of 2.\n\nThe on-chain proposal to be approved by governance will include the following transaction to be executed via the [Long Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters):\n\n\n\n* Call upgradeAndCall() on the Safety Module [Proxy Admin](https://github.com/dydxfoundation/governance-contracts/blob/dd1c396733a245ffb0faac15f657ace87d289b92/contracts/dependencies/open-zeppelin/ProxyAdmin.sol) contract, to atomically perform the following:\n    1. Upgrade the Safety Module to use the new implementation contract.\n    2. Run the initializer function.\n\n**Rationale**\n\nDifferent approaches were considered as to how to handle the funds that had already been staked. The “clean slate” approach of resetting the Safety Module is recommended as we believe it is the simplest and safest solution from a technical perspective.\n\nReaching community consensus and implementing a quick solution will allow recovery of the locked funds, and allow everyone access to the Safety Module staking pool. The Safety Module adds an important, additional safeguard to the protocol. It should be noted that Safety Module contract upgrades must use the long timelock, which imposes a minimum 18 day period (~1 day voting delay, 10 days voting duration, and 7 day timelock) between when a proposal is created and when it takes effect. In addition, long timelock proposals require a minimum quorum of 100 million DYDX (10% of the total supply) in order to pass. This means any solution will require broad community support as well as governance participation from dYdX investor token holders. For these reasons, it is imperative that the community approve this DIP in its simplest form as soon as possible.\n\n**Test Cases**\n\nThe Safety Module has a full suite of [unit tests](https://github.com/dydxfoundation/governance-contracts/tree/master/test/safety-module) providing 100% code coverage. The proposed fix was simulated in both a local and forked mainnet environment. The test suite was then run, to ensure that full functionality will be restored, following the execution of the governance proposal on mainnet.\n\nIn addition to unit testing, thorough validation was performed on the mainnet state to ensure that we have a thorough and accurate understanding of both the current smart contract state on mainnet and the precise nature of the bug. This validation included checking all smart contract [state](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/state.spec.ts) and [logs](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/events.spec.ts), verification of the contract [bytecode](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/bytecode.spec.ts), and detailed analysis of [storage slots](https://github.com/dydxfoundation/governance-contracts/blob/master/test/safety-module/storage-slots.spec.ts), including those that are not directly accessible by the contract. All test and deploy scripts are open-sourced in the dYdX Foundation [governance contracts](https://github.com/dydxfoundation/governance-contracts) repository.\n\n[Detailed instructions](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/README.md) are provided on GitHub to allow anybody to run the same tests.\n\n**Implementation**\n\nA [full implementation](https://github.com/dydxfoundation/governance-contracts/tree/master/contracts/safety/v2) is open-sourced in the dYdX Foundation governance contracts repository.\n\n**Copyright**\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmSDfpzkGsp4X1C92XvCnxZrNLcnGsai6oxhLVgMsABAxH",
    "encodeIpfsHash": "0x39a4f2729cd8ffaee39540b8e7efca36a0a1c98ecb9cb216afa0f412248f6faa"
  },
  {
    "DIP": 4,
    "title": "Safety Module Staker Reimbursement and Compensation",
    "status": "Proposed",
    "author": "Jacob Goh (@jteamdc)",
    "shortDescription": "Reimburse and compensate the early Safety Module stakers whose funds were stuck.",
    "discussions": "https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause",
    "created": "2021-10-14T00:00:00.000Z",
    "preview": "**DIP Summary**\n\nReimburse early Safety Module stakers for the full …",
    "basename": "DIP-4",
    "description": "\n\n\n**DIP Summary**\n\nReimburse early Safety Module stakers for the full amount of their staked funds, plus an additional 10% compensation.\n\n**Abstract**\n\nAn error in the Safety Module deployment led to stakers' funds being stuck in the contract. As a result, DIP-1 was submitted as a proposal to fix the Safety Module, return funds to stakers, and compensate stakers for their missed rewards and inconvenience.\n\nThe on-chain vote for DIP-1 failed. This new proposal aims to enact the reimbursement and compensation plan that would have taken effect under DIP-1. Unlike DIP-1, this proposal does not fix the Safety Module itself. This proposal is therefore governed by the parameters of the short timelock, which has a much lower quorum requirement than the long timelock.\n\n**Relevant Links**\n\n* Safety Module Incident Report: [https://dydx.foundation/blog/en/outage-1](https://dydx.foundation/blog/en/outage-1)\n* Community discussion thread: [https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause](https://commonwealth.im/dydx/proposal/discussion/1743-safety-staking-pool-on-pause)\n* DRC - Incident Report of the Safety Module Outage & Proposed Solution Thread: [https://commonwealth.im/dydx/proposal/discussion/1770-drc-incident-report-of-the-safety-module-outage-proposed-solution](https://commonwealth.im/dydx/proposal/discussion/1770-drc-incident-report-of-the-safety-module-outage-proposed-solution)\n* DRC Snapshot: [https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn](https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn)\n* Pull Request with Proposed Fix Implementation: [https://github.com/dydxfoundation/governance-contracts/pull/1](https://github.com/dydxfoundation/governance-contracts/pull/1)\n* Safety Module Smart Contract: [https://etherscan.io/address/0x65f7BA4Ec257AF7c55fd5854E5f6356bBd0fb8EC](https://etherscan.io/address/0x65f7BA4Ec257AF7c55fd5854E5f6356bBd0fb8EC)\n* Safety Module Documentation: [https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool](https://docs.dydx.community/dydx-governance/staking-pools/safety-staking-pool)\n* Safety Module Blogpost: [https://dydx.foundation/blog/en/safety-staking](https://dydx.foundation/blog/en/safety-staking)\n\n**Motivation**\n\nAs discussed in DIP-1, following the Safety Module outage, the dYdX Foundation released a detailed [incident report](https://dydx.foundation/blog/en/outage-1) explaining the cause of the error, the impact to users, a proposed solution, and lessons learned.\n\nAfter robust discussion on the Forums, a community member launched a 5-day poll on Snapshot regarding the question of reimbursing stakers for rewards they did not receive due to the outage. The results of the poll are available [here](https://snapshot.org/#/dydxgov.eth/proposal/QmbJ5QxHr1pyShKTDaF5DjAr6vxQn8DVxshH2fyWgzDCBn). In aggregate, 575 DYDX token holders and delegates voted with 17,112,789 DYDX. With 413 voters and 16,682,487.634 DYDX (97.4855% of total) in agreement, there was an overwhelming consensus that stakers should receive 10% of their staked DYDX to make them whole.\n\n**Specification**\n\nUsers affected by the Safety Module outage will receive funds via a Recovery Contract. The same contract that was deployed as part of the DIP-1 implementation will be used.\n\n***Reimbursement***\n\nThere are currently ~157,459 DYDX staked to the Safety Pool from 56 unique stakers. These funds are recoverable by governance via the long timelock.\n\nThis DIP specifies that action be taken via the **short timelock** to withdraw the same amount of DYDX from the Rewards Treasury to fund the Recovery Contract. This allows the stakers to get their funds back sooner.\n\n***Additional Reimbursement***\n\nThose 56 stakers who were affected by the bug will receive an additional 15,746 DYDX, pro-rata, to make them whole. This will be paid out from the Rewards Treasury, and claimable by stakers through the same Recovery Contract. There will be no lockup on these funds.\n\nEach staker will need to call the claim() function directly on the Recovery Contract to receive their funds. They may then decide if they want to re-stake in the Safety Module.\n\n***Smart Contract Implementations:***\n\n* The [Recovery Contract](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/v2/helpers/SM2Recovery.sol) will be deployed with a hardcoded mapping from address to DYDX token amount. This amount should include the amount that was staked by that address, plus the additional 10%.\n    * As a precaution, this contract will be upgradeable via the [Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters).\n\nThe on-chain proposal to be approved by governance will include the following transaction to be executed via the [Short Timelock](https://docs.dydx.community/dydx-governance/voting-and-governance/governance-parameters):\n\n* Call transfer() on the [Rewards Treasury](https://github.com/dydxfoundation/governance-contracts/blob/336cb686b0c50693639a0fdb639d0b8f3b0670b3/contracts/treasury/Treasury.sol) contract, to transfer ~15,746 DYDX to the [Recovery Contract](https://github.com/dydxfoundation/governance-contracts/blob/336cb686b0c50693639a0fdb639d0b8f3b0670b3/contracts/safety/v2/helpers/SM2Recovery.sol) which was previously deployed to `0xF3f6e3fad2D453ca0Ce3c8580ecBE801F04c5662`.\n\n**Rationale**\n\nStaked DYDX tokens have been locked in the smart contract since September 7, and remain locked until a fix is implemented by governance. Given that the Staking Module only processes withdrawals on an epoch basis (every 28 days), the staked tokens would have been locked at a minimum for the remainder of the epoch. The community generally agreed that it was reasonable to make stakers whole due to this error. Consensus evolved around the need to repay stakers for the amount they reasonably could have expected to earn by staking over an epoch, plus some damages. 10% of the amount staked for each affected address is a reasonable and simple policy.\n\n**Test Cases**\n\nThe recovery contract implementation, as well as test and deploy scripts, were open-sourced in the dYdX Foundation [governance contracts](https://github.com/dydxfoundation/governance-contracts) repository. The reimbursement process was thoroughly tested in both test and mainnet fork environments.\n\n[Detailed instructions](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/safety/README.md) are provided on GitHub to allow anybody to run the same tests.\n\n**Implementation**\n\nA [full implementation](https://github.com/dydxfoundation/governance-contracts/tree/master/contracts/safety/v2) is open-sourced in the dYdX Foundation governance contracts repository.\n\n**Copyright**\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmenjymprVdXs1TcqTQGU6xMa4fsMpHSYrGt9sh2Q2YnVq",
    "encodeIpfsHash": "0xf46a0d016423b39604aa1b72aee420847f981579c4b5e0c7a1d8d3210705df64"
  },
  {
    "DIP": 5,
    "title": "Upgrade the StarkProxy smart contract",
    "status": "Proposed",
    "author": "Yuriy Myronovych (@YuriyWintermute)",
    "short description": "Upgrade StarkProxy smart contracts to support deposit cancellation and recovery.",
    "discussions": "https://forums.dydx.community/proposal/discussion/2437-drc-smart-contract-upgrade-for-market-maker-borrowers-from-liquidity-staking-pool/",
    "preview": "## Simple Summary\n\nUpgrade StarkProxy smart contracts to support …",
    "basename": "DIP-5",
    "description": "\n\n## Simple Summary\n\nUpgrade StarkProxy smart contracts to support deposit cancellation and recovery.\n\n## Abstract\n\nWhen depositing USDC to the dYdX Layer 2 exchange, the funds are held in a bridge contract while waiting for the deposit to be processed by the L2 sequencer and prover. While funds are on the bridge awaiting confirmation, the depositor can initiate a time-locked recovery process to cancel the deposit. This functionality is not currently supported by the Stark Proxy smart contracts which manage the funds borrowed by market makers from the Liquidity Module staking pool. These Stark Proxy smart contracts should be upgraded to support deposit cancelation and recovery.\n\n## Motivation\n\nOn October 27, 2021 09:37:37 AM +UTC, we (Wintermute) borrowed 50 million USDC (transaction [here](https://etherscan.io/tx/0xa9cc82d4d8e6360538bb3c61e91a6c2494d98d7644d4516b0456a8008dad0e47)) from the [Liquidity Staking Pool](https://docs.dydx.community/dydx-governance/staking-pools/liquidity-staking-pool) and attempted to deposit the funds to our trading account on the dYdX exchange. We had to send deposit programmatically because the client provided by the dYdX Foundation team does not support wallet-connect yet. Unfortunately, the wrong “vaultId” parameter was passed in the call to “depositToExchange” (transaction [here](https://etherscan.io/tx/0xe6a1130a56abf62a076ef4210a28da20e06226295b54fc52b89a6b61850dca8e)). Because this “vaultId” did not correspond to our STARK key, the deposit was invalid and could not be confirmed on L2.\nThe 50M USDC are safely held by the dYdX L2 exchange smart contract and can be reclaimed by the StarkProxy contract. However, to reclaim the funds, the StarkProxy contract must call “depositCancel” and “depositReclaim” on the L2 exchange smart contract. \nUpgrading these smart contracts would allow us to recover the 50M USDC and ensure that other market makers can safely make use of the Liquidity Staking Pool.\n\nFollowing a forum DRC [thread](https://forums.dydx.community/proposal/discussion/2437-drc-smart-contract-upgrade-for-market-maker-borrowers-from-liquidity-staking-pool/), Wintermute launched a 5-day poll on Snapshot regarding the question of Stark Proxy upgrade. The results of the poll are available [here](https://snapshot.org/#/dydxgov.eth/proposal/0x3d62d5b77b2b9bd3ab1c42c296cc36ccf89f77bea22815081e785d5d28d32366). The Snapshot vote has concluded with 5.3M DYDX (99.92%) from 474 voters indicating consensus in favor of the DRC. \n\n## Specification\n\nWhen market makers borrow funds from the Liquidity Module staking pool they must do so via a StarkProxy smart contract which manages the funds and limits how they may be used. The StarkProxy borrows funds from the pool using a “borrow” call and then deposits those to the exchange using “depositToExchange” providing multiple parameters in transaction data describing which account should be credited. This deposit transaction transfers funds to the dYdX L2 exchange smart contract ([here](https://etherscan.io/address/0xd54f502e184b6b739d7d27a6410a67dc462d69c8)) and, if a deposit is valid, it is submitted and confirmed on L2. If the deposit parameters are misspecified by the caller, it may not be possible to credit the deposit. In such a case, as long as the “starkKey” was correctly specified in the deposit, the depositor can reclaim their funds using the “depositCancel” and “depositReclaim” functions. This process is described [here](https://docs.starkware.co/starkex-v3/starkex-deep-dive/smart-contracts-1/public-interactions#deposit).\nSince “depositCancel” and “depositReclaim” are not currently implemented on the StarkProxy contract, it is not possible for those contracts to reclaim funds in the case where a deposit transaction is malformed and unable to be processed. \nCurrently there is one such invalid deposit of 50M USDC which must be canceled in order for the funds to be recovered and put to use. The deposit is invalid because the wrong vault number was used, and the vault number and stark key specified in the deposit transaction do not match.\n  \n**Implementation**\n\nUpgraded Stark Proxy implementation [Stark Proxy V2](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/stark-proxy/README.md) is open-sourced in the dYdX Foundation governance contracts repository.\n\n\n**Test Cases**\n\nTest cases for Stark Proxy have been extended to cover new V2 functions. It is open-sourced in the dYdX Foundation [Stark Proxy tests](https://github.com/dydxfoundation/governance-contracts/tree/master/test/stark-proxy) folder. The deposit and cancelation process was thoroughly tested in both test and mainnet fork environments.\n\n[Detailed instructions](https://github.com/dydxfoundation/governance-contracts/blob/master/contracts/stark-proxy/README.md) are provided on GitHub to allow anybody to run the same tests.\n\n**Copyright**\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmcS5tHrVCYLqNMa1f2wy8BxH4S675exNEddREnwED474Z",
    "encodeIpfsHash": "0xd167fcb63051ad9d279acab717a8d19966e1d111beb92d16619c1851ed999afe"
  },
  {
    "DIP": 6,
    "title": "dYdX Grants Program",
    "status": "Proposed",
    "author": "Reverie",
    "shortDescription": "Launch a Grants Program with $6.25m from the Community Treasury",
    "discussions": "https://forums.dydx.community/proposal/discussion/2511-drc-dydx-grants-program/",
    "created": "2022-01-02T00:00:00.000Z",
    "preview": "## Simple Summary\n\nLaunch the dYdX Grants Program with $6.25m moved …",
    "basename": "DIP-6",
    "description": "\n\n## Simple Summary\n\nLaunch the dYdX Grants Program with $6.25m moved from the Community Treasury to the Grants Multi-sig.\n\n## Abstract\n\nReverie is proposing to lead a Grants program for the dYdX community to engage participants and attract new contributors. Grants will include both small and large projects with grantees ranging from single individuals to institutional teams. A Grants Committee, specified in the DRC, will control the multi-sig and\nadvise the lead team on grants. A list of initial RFP ideas has been published on the website with the hopes of inspiring future contributors. Applicants are\nencouraged to apply for existing RFPs or propose new Grant projects. The lead team will review all applications and submit funding proposals to the Committee.\n\nThe snapshot vote concluded with 314 voters and 18M DYDX in agreement (98.9%). The vote results have shown significant support for the program.\nhttps://forums.dydx.community/snapshot/dydxgov.eth/0xe77513bfec9f55b1d620d973af1c4da1266ceffd333cbb120bc54a9359d27a40\n\n**Relevant Links**\n\nDGP website: https://dydxgrants.com/\n\nDRC discussion: https://forums.dydx.community/proposal/discussion/2511-drc-dydx-grants-program/\n\n## Motivation\n\nThe goal of the program is to increase the contributor count and actively promote the growth of the dYdX protocol. While initial grants cannot directly change\nthe dYdX product or core development, Grantees will have the opportunity to impact growth through external tools and non-technical projects (e.g. Analytics dashboards, newsletters, governance etc..). This contributor growth will lead to improvements across both user experiences and the overall community.\n\n## Specification\n\n**Program Design**\n\n* $3m DYDX Funding per quarter for two quarters\n* 1 Full Time Lead\n* 8 Committee Members\n* Committee Member held Multi-Sig\n\nThe treasury will move $6.25m worth of DYDX to the Committee Member multi-sig.\n\nFunds will be used to reward Grantees, pay the Lead and cover additional program costs. Grantees will be subject to milestones that can determine compensation structure, with standard payouts being 25% upfront and the remainder upon completion.\n\n**DYDX Amount**\n\nThe amount of DYDX to be moved from the community treasury to the DGP Multisig will be determined using a 24h vwap of the trades executed on the most liquid exchange, namely Binance.com. Given it makes up roughly 30% of the 24h volume, the DYDX/USDT Binance market data will be used to derive a market price. The data will be pulled from https://data.binance.vision/?prefix=data/spot/daily/trades/DYDXUSDT/. The previous day's trades will be used to capture a full 24h window so as to avoid timing constraints. As such, we will use the following data set: https://data.binance.vision/data/spot/daily/trades/DYDXUSDT/DYDXUSDT-trades-2022-01-01.zip.\n\nThis formula will be used to calculate the price: Σ(Price * Volume) / Σ(Volume).\n\nFrom the data above, we find: $16,199,143.30 / 1,949,010.42 = $8.31.\n\nThe DYDX Amount to be transferred will be $6,250,000 / $8.31 = **752000.00** (rounded up to the nearest thousand for simplicity).\n\n\n## Rationale\n\nThe community has addressed certain concerns and issues with a Grants program in the DRC, but overall consensus has been in strong support of launching. The program will make productive use of treasury funds to promote the protocol and engage contributors. Promoting external tools and analytics dashboards, among other projects, will improve the product experience and should lead to user growth. The program will also attract third party providers and other institutional teams that can build bridges and relevant tools to improve governance and trading experiences.\nGrants programs have been successful to grow an active contributor base and benefit the underlying protocol. We hope to bring this same positive growth to dYdX with this program.\n\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmacUQX3qPA9syW5oxdauoJw7tBx9J2msbsmyfVMC7gkFn",
    "encodeIpfsHash": "0xb659e2db02977540be8821312b75aa2e18d9e8ab60a2708b3d64e7fd5bc7c9bd"
  },
  {
    "DIP": 7,
    "title": "Update Trading & Liquidity Provider rewards formulas to include holding of stkDYDX",
    "status": "Proposed",
    "author": "Jeffrey Walfred",
    "shortDescription": "Update Trading & Liquidity Provider rewards formulas to include holding of stkDYDX",
    "discussions": "https://forums.dydx.community/proposal/discussion/2940-drc-update-trading-liquidity-provider-rewards-formulas-to-include-holding-of-stkdydx/",
    "created": "2021-12-21T00:00:00.000Z",
    "preview": "## Simple Summary\n\nTo better incentivize utility of the DYDX token, …",
    "basename": "DIP-7",
    "description": "\n\n## Simple Summary\n\nTo better incentivize utility of the DYDX token, usage of the dYdX ecosystem, and to protect the protocol through increased adoption of the Safety Staking Pool, the dYdX Foundation proposed to adjust the formulas for Trading Rewards and Liquidity Provider Rewards to both include holding of stkDYDX. The dYdX Community voted and approved these changes via a Snapshot vote that concluded on December 20, 2021.\n\n## Abstract\n\nIn response to a thread that the dYdX Foundation posted proposing these changes, a community member submitted a snapshot vote on December 15, 2021 to conclude on December 20, 2021.\n\nThe Snapshot vote concluded with 864.64K DYDX voting “Yes” and 1.54K DYDX voting “No.” 316 unique addresses voted in the snapshot. The majority of the community (312 voters & 99.82% of DYDX) supported to change the formulas.\n\nRelevant Links:\nForum discussion proposing the update: https://forums.dydx.community/proposal/discussion/2940-drc-update-trading-liquidity-provider-rewards-formulas-to-include-holding-of-stkdydx/\n\nSnapshot vote: https://snapshot.org/#/dydxgov.eth/proposal/0xfbcb8104dc469cae09727dea89577f89b37df784c3ef2715b26ab77e9ae15161\n\n## Motivation\n\nIt is quite clear that the existing liquidity mining programs have been extremely successful in incentivizing onboarding and usage of the dYdX protocol since its inception. However, the liquidity mining programs do not currently incentivize users to remain participants in the dYdX ecosystem. This proposal aims to address this issue.\n\n## Rationale\n\nBy including stkDYDX as variables in the Trading Rewards and Liquidity Provider Reward formulas, the community can better convert dYdX protocol users to become long term participants in the dYdX ecosystem and, ultimately, contributors to the protocol while further protecting the protocol from existential black-swan events via increasing the size of the Safety Staking Pool.\n\n## Implementation\n\nDYDX smart contracts do not directly control the liquidity mining formulas. If approved, the dYdX Foundation will request that dYdX Trading Inc. implement the changes in time for Epoch 5.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "Qma4EngWtzwK4pLfAeTyVgiYGd2WgXEUhoCyb8xHjUAU1M",
    "encodeIpfsHash": "0xae17e7091f2495d3875b17b4da0483546516334d6e0c286cf68d446454c093b8"
  },
  {
    "DIP": 8,
    "title": "Reducing liquidity provider rewards threshold from 1% to 0.25%",
    "status": "WIP",
    "author": "Denis Tenchurin (@dionist)",
    "shortDescription": "Reducing liquidity provider rewards threshold from 1% to 0.25%",
    "discussions": "https://forums.dydx.community/discussion/3683-drc-reduce-the-threshold-for-receiving-liquidity-provider-rewards",
    "created": "2022-02-15T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThe purpose of this DIP is to reduce the …",
    "basename": "DIP-8",
    "description": "\n\n\n## Simple Summary\n\nThe purpose of this DIP is to reduce the liquidity provider rewards threshold for market makers from 1% to 0.25% so that smaller and medium-sized market makers can be included as well.\n\n## Abstract\n\nIn reference to a thread on market maker incentives, Denis Tenchurin submitted a Snapshot vote to reduce the volume threshold % for market makers to qualify to receive Liquidity Provider Rewards.\n\nThe Snapshot vote concluded with a record 306 unique voters and 27M DYDX in agreement. The majority of the community (195 voters & 99.8% of DYDX) supported to reduce the threshold to 0.25%.\n\n## Relevant Links:\n\nSnapshot vote for DYDX holders: https://snapshot.org/#/dydxgov.eth/proposal/0x785066561be1e5d170eb28960da5ef2643ee0d0c3d590fd797c028512cc6be43\n\nMaker Volume Distribution: https://metabase.dydx.exchange/public/dashboard/5fa0ea31-27f7-4cd2-8bb0-bc24473ccaa3\n\nDiscussions: https://forums.dydx.community/discussion/3683-drc-reduce-the-threshold-for-receiving-liquidity-provider-rewards\n\n## Motivation\n\nHaving a high threshold of 1% is worse for liquidity on dYdX. It excludes smaller and small-sized market makers from competing with larger market makers.\n\n28 more market makers would be included in the next epoch if the threshold had been reduced to 0.25%.\n\n## Rationale\n\nReducing this threshold from 1% to 0.25% will provide better competition for tight quoting and uptime (especially on alt pairs, which have had quite wide spreads) and should result in better liquidity overall across dYdX Protocol.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmXQcrMc97RpPEvNTDpKNsi8vooTkUyvceVMsL4JrEbG1e",
    "encodeIpfsHash": "0x86bd67ad5161344cd10a9f423c99c9178357fefbdd31cb33bae6df4e0113fcc1"
  },
  {
    "DIP": 9,
    "title": "Guernsey Purpose Trust for the dYdX Grants Program (DGP)",
    "status": "Approved",
    "author": "Reverie (@hi_reverie)",
    "shortDescription": "Implement a Guernsey Purpose Trust for the dYdX Grants Program (DGP)",
    "discussions": "https://forums.dydx.community/discussion/4049-drc-implement-a-guernsey-purpose-trust-for-the-dydx-grants-program-dgp",
    "created": "2022-03-21T00:00:00.000Z",
    "preview": "## Simple Summary\n\nThe purpose of this DIP is to implement a …",
    "basename": "DIP-9",
    "description": "\n\n\n## Simple Summary\n\nThe purpose of this DIP is to implement a Guernsey Purpose Trust for the dYdX Grants Program to enable a number of benefits to both tokenholders and the parties involved in the program.\n\n## Abstract\n\nFollowing guidance from the dYdX Foundation Legal team, the dYdX Grants Program aims to implement a Guernsey Purpose Trust structure so as to solidify it's legal stature and allow for necessary scaling activities including selling of DYDX for stablecoins and off-chain activity.\n\nThe Snapshot vote concluded with 536 unique voters and a total 37,422,308 DYDX voted. The overwhelming majority of the community (531 voters & 99.07% of DYDX) were in favor of moving forward with this proposal.\n\n## Relevant Links:\n\nTrust Document: https://drive.google.com/file/d/1HV97VtmeHSt2Fof920TzR7utuSStBFhZ/view\n\nLegal Framework: https://dydx.foundation/blog/en/legal-framework-non-us-trusts-in-daos#fn-1\n\nForum Discussion: https://forums.dydx.community/discussion/4049-drc-implement-a-guernsey-purpose-trust-for-the-dydx-grants-program-dgp\n\nSnapshot Vote: https://snapshot.org/#/dydxgov.eth/proposal/0xb9b56460e9d529ef13ee5a370e60bbc3b2618c2dbf64761a5540e47adfb195fc\n\n## Motivation\n\nThis measure will help the dYdX Grants Program unlock a number of benefits, including but not necessarily limited to:\n\n- Allow the DGP to sell DYDX for stablecoins without incurring tax liability, enabling payments to large providers and US based grantees.\n- Increase legal protection for the Grants Committee as Trustees and Reverie as the Enforcer of the Trust.\n- Allow Trustees (Committee members) to sign off-chain agreements on behalf of the Trust.\n- Allow DYDX tokenholders to retain decision-making as to the Trustees, the Enforcer, terminating the Purpose Trust and transerring assets.\n\n## Rationale\n\nImplementing this Trust structure will provide full control of the Grants program to DYDX tokenholders while also benefiting all parties involved with increased legal protection. This move will also help the program scale through off-chain agreements and payments to US based grantees.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "ipfsHash": "QmSjSti6HL2qjhck3vn5i3JsQPuaDPXQ7n3WiHJ42xUkrf",
    "encodeIpfsHash": "0x4145be9c05fd70e399f8253167b119f02dd16fcfd5a5bb0543ad336ce9da99d4"
  }
]